Revit 2026 API

# DividedPathIsIntersectorValidForCreation Method

---

This returns true if the intersector is an element that can be used to intersect with a newly created divided path.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsIntersectorValidForCreation(
	Document document,
	ElementId intersector
)
```
```vb
Public Shared Function IsIntersectorValidForCreation (
	document As Document,
	intersector As ElementId
) As Boolean
```
```cpp
public:
static bool IsIntersectorValidForCreation(
	Document^ document,
	ElementId^ intersector
)
```
```fsharp
static member IsIntersectorValidForCreation :
        document : Document *
        intersector : ElementId -> bool
```

#### Parameters

document Document
     The document.
intersector ElementId
     The intersector.

#### Return Value

Boolean True if the reference can be used to create a divided path, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Intersectors can be curve elements, datum planes, or divided paths. This function is should not be used to validate the input to SetIntersectors() because it does not check for self intersection of any other circular dependencies between intersectors. Use isIntersectorValidForDividedPath() instead.

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace